# Brewfile — konfig. regenerate: ./install.sh dump
# install all: ./install.sh   (or: brew bundle)

tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "sinelaw/fresh"
tap "xwmx/taps"

brew "a2ps"
brew "asciidoc"
brew "asciidoctor"
brew "asciinema"
brew "asciiquarium"
brew "aspell"
brew "berkeley-db"
brew "bib-tool"
brew "bibclean"
brew "bibtex-tidy"
brew "bison"
brew "bpytop"
brew "bsdmake"
brew "btop"
brew "cabal-install"
brew "calcurse"
brew "chezscheme"
brew "chicken"
brew "chruby"
brew "clisp"
brew "cmatrix"
brew "coreutils"
brew "crystal"
brew "curl"
brew "docker"
brew "duf"
brew "dust"
brew "emacs"
brew "enscript"
brew "entr"
brew "erlang"
brew "eza"
brew "feedgnuplot"
brew "fennel"
brew "ffmpeg"
brew "figlet"
brew "fpc"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "git-filter-repo"
brew "glances"
brew "global"
brew "glow"
brew "gnu-smalltalk"
brew "go"
brew "groff"
brew "groovy"
brew "gtksourceview3"
brew "haskell-language-server"
brew "helix"
brew "highlight"
brew "htop"
brew "hugo"
brew "hwatch"
brew "imagemagick"
brew "imagemagick@6"
brew "ispell"
brew "janet"
brew "jed"
brew "joe"
brew "kakoune"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kotlin"
brew "lf"
brew "libffi"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "lua@5.3"
brew "luarocks"
brew "macvim"
brew "markdown-toc"
brew "mdcat"
brew "mdfried"
brew "mdp"
brew "micro"
brew "midnight-commander"
brew "mle"
brew "nano"
brew "nbsdgames"
brew "ncdu"
brew "ne"
brew "neovim"
brew "nim"
brew "nnn"
brew "ocaml"
brew "openblas"
brew "ox"
brew "par"
brew "parallel"
brew "pipes-sh"
brew "pipx"
brew "poppler"
brew "presenterm"
brew "prettier"
brew "purescript"
brew "pylint"
brew "pyright"
brew "python@3.10"
brew "qt"
brew "qt@5"
brew "railwaycat/emacsmacport/emacs-mac@29"
brew "ranger"
brew "rlwrap"
brew "ruby-install"
brew "ruff"
brew "rust-script"
brew "sbcl"
brew "scheme48"
brew "sinelaw/fresh/fresh"
brew "starship"
brew "swi-prolog"
brew "tectonic"
brew "terminator"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "twine"
brew "unzip"
brew "vifm"
brew "vim"
brew "watch"
brew "wget"
brew "xwmx/taps/nb"
brew "yazi"
brew "youplot"
brew "zellij"
brew "zim"
brew "zlib"

cask "cabal"
cask "claude"
cask "cursor"
cask "discord"
cask "far2l"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "fresh"
cask "geany"
cask "golly"
cask "joplin"
cask "kitty"
cask "lapce"
cask "lastpass"
cask "love"
cask "mactex"
cask "markedit"
cask "qownnotes"
cask "racket"
cask "save-hollywood"
cask "spotify"
cask "warp"
cask "webviewscreensaver"
cask "wezterm"
cask "zed"
